R12/TEST_CASES/1.4/sample_request_base_Dhaval.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <ns1:ItemPriceRequest xmlns:ns1="http://xmlns.irco.com/WebtopssItemPriceProvABCSImpl">
               <ControlArea>
      <PartnerCode>WEBTOPPS</PartnerCode>
      <InstanceName>WEBDEV</InstanceName>
      <RequestType>PROCESS</RequestType>
      <MessageID>E3C3E45006B0489CE0430B63560AA260</MessageID>
   </ControlArea>
   <DataArea>
      <ItemPrice>
         <ConfiguredItem>YHC060F1RMA**H000000000A00000C0000000000</ConfiguredItem>
         <ProductCode>2005045</ProductCode>
         <ProductFamily>2005045</ProductFamily>
         <PricelistName>kukrejatestPL0348224</PricelistName>
         <ListPrice>99</ListPrice>
         <UOM>EA</UOM>
         <POA>SAMPLE_POA</POA>
         <StartDate>2013-08-18T17:52:47</StartDate>
         <EndDate>2013-08-18T17:52:47</EndDate>
         <AccessoryFlag>Y</AccessoryFlag>
         <AccessoryItem>YHC060F1</AccessoryItem>         
         <ItemPriceFetch>
            <Header>
               <SourceHeaderRef>1876543</SourceHeaderRef>
               <OperatingUnitCode>IEOUEUR</OperatingUnitCode>
               <BusinessUnit></BusinessUnit>
               <PricingDate>2013-08-18T17:52:47</PricingDate>
               <CustomerNumber>27793</CustomerNumber>
               <SoldToSite></SoldToSite>
               <CurrencyCode>USD</CurrencyCode>
               <CheckType>PRICE</CheckType>
               <Line>
                  <SourceLineRef></SourceLineRef>
                  <PartNumber></PartNumber>
                  <Quantity>1</Quantity>
                  <UOM></UOM>
                  <SupplierNumber></SupplierNumber>
                  <ManufacturingLocation></ManufacturingLocation>
                  <DivisionCode></DivisionCode>
                  <OrderType></OrderType>
                  <ShipmentPriority></ShipmentPriority>
                  <ShipFrom></ShipFrom>
                  <LineCategory></LineCategory>
                  <FreightTerms></FreightTerms>
                  <SalesChannel></SalesChannel>
                  <BillTo></BillTo>
                  <OrderSource></OrderSource>
                  <ModifierNumber></ModifierNumber>
                  <PricingAttribute1></PricingAttribute1>
                  <ModelNumber></ModelNumber>
                  <ItemType></ItemType>                  
               </Line>
            </Header>
         </ItemPriceFetch>
      </ItemPrice>
   </DataArea>
        </ns1:ItemPriceRequest>
    </soap:Body>
</soap:Envelope>
